Revit 2026 API

# WallAllowWrappingAtLocation Method

---

Allow end wrapping at the location.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AllowWrappingAtLocation(
	int locationIndex
)
```
```vb
Public Sub AllowWrappingAtLocation (
	locationIndex As Integer
)
```
```cpp
public:
void AllowWrappingAtLocation(
	int locationIndex
)
```
```fsharp
member AllowWrappingAtLocation :
        locationIndex : int -> unit
```

#### Parameters

locationIndex Int32
     0 or 1 represents wall's end, other number represents the wrapping locations on vertical faces of openings or profiles.

| Exception | Condition |
| --- | --- |
| ArgumentException | This location is invalid for wrapping. |
| InvalidOperationException | End wrapping is disabled in wall type. |

If Wrapping At Ends in wall type is set to none, this function throws InvalidOperationException If the location is invalid, for example: wall doesn't have this location or the location is joined, this function throws ArgumentException.

#### Reference

Wall Class

Autodesk.Revit.DB Namespace